app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(post_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-10-24 23:15:42.917839"], ["updated_at", "2017-10-24 23:15:42.917839"]]